package classes;

public class Ex16_page330_self {
	public static void main(String[] args) {
//		ex01();
//		ex02();
	}

	private static void ex02() {
//		2. final 필드와 상수(static final)에 대한 설명으로 틀린 것은 무엇입니까? ( 2 )
//				① final 필드와 상수는 초기값이 저장되면 값을 변경할 수 없다.
//				② final 필드와 상수는 생성자에서 초기화될 수 있다.
//				③ 상수의 이름은 대문자로 작성하는 것이 관례이다.
//				④ 상수는 객체 생성 없이 클래스를 통해 사용할 수 있다.
//		final 필드: 객체마다 저장되고 생성자의 매개값을 통해 여러 가지 값 보유 가능
//		static final 필드: 객체마다 저장되지 않고 클래스에만 포함되며 초기값 저장 시 변경 불가
	}

	private static void ex01() {
//		1. 인스턴스 멤버와 정적 멤버에 대한 설명 중 맞는 것에 O표, 틀린 것에 X표 하세요.
//		① 정적 멤버는 static으로 선언된 필드와 메소드를 말한다. ( O )
//		② 인스턴스 필드는 생성자에서 초기화될 수 없다. ( X )
//		③ 정적 필드와 메소드는 객체 생성 없이 클래스를 통해 접근할 수 있다. ( O )
//		④ 인스턴스 필드와 메소드는 객체를 생성하고 사용해야 한다. ( O )
	}
}