package extend.ex09;

public class Ex09_p392 {
	public static void main(String[] args) {
//		ex03();
//		ex02();
//		ex01();
	}

//	private static void ex03() {
//		3. final 클래스, final 필드, final 메소드에 대한 설명입니다. 맞는 것에 O표, 틀린 것에 X표 하세요.
//		① 모두 상속과 관련이 있다. ( x )
//		② final 메소드를 가진 클래스는 부모 클래스가 될 수 없다. ( x )
//		③ final 메소드는 재정의를 할 수 없다. ( O )
//		④ final 클래스는 final 필드가 반드시 있어야 한다. ( x )
//	}

//	private static void ex02() {
//		2. 메소드 재정의(오버라이딩)에 대한 설명입니다. 맞는 것에 O표, 틀린 것에 X표 하세요.
//		① 부모의 메소드는 숨김 효과가 나타난다. ( O )
//		② 재정의 시 접근 제한을 더 강하게 할 수 있다. ( X )
//		③ @Override를 붙이면 컴파일러가 재정의를 확인한다. ( O )
//		④ 부모 메소드를 호출하고 싶다면 super 키워드를 사용할 수 있다. ( O )
//	}

//	private static void ex01() {
//		1. 자바의 상속에 대한 설명입니다. 맞는 것에 O표, 틀린 것에 X표 하세요.
//		① 자바는 다중 상속을 허용한다. ( X )
//		② 부모의 메소드를 자식 클래스에서 재정의(오버라이딩)할 수 있다. ( O )
//		③ 부모의 private 접근 제한을 갖는 필드와 메소드는 상속의 대상이 아니다. ( O )
//		④ protected 멤버는 같은 패키지의 모든 클래스와 다른 패키지의 자식 클래스만 접근할 수 있다. ( O )
//	}
}